[{"url":"https://ch.linkedin.com/jobs/view/angular-developer-–-bern-at-noir-3749854341?refId=RrfznhAM8LrRLKCk8l6Vbg","body":"<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n          relative overflow-hidden\">\n        <strong>Angular Developer – Social Messaging Platform – Bern<br><br></strong>(Tech stack: Angular Developer, Angular, HTML, CSS, TypeScript, JavaScript, jQuery, React, VueJS, Web, UI, UX, User Interface, User Experience, Front End, Angular Developer)<br><br>In 2012 our client launched a social messaging platform that has been taking the US by storm. After an extremely successful period our client has decided to hop across the Atlantic, in a bid to expand their sphere of influence and take up a firm foothold in the UK and European markets.<br><br>A number of new offices are being opened in Switzerland and our client is looking for talented, enthusiastic and passionate Angular Developer to bring their product to these new markets and help enhance this already successful company!<br><br>They are looking for an Angular Developer with experience in some or all of the following (full training will be provided to fill any gaps in your skill set Angular 6+, HTML5, CSS3, TypeScript, JavaScript, SASS, jQuery, React, VueJS and AJAX.<br><br><strong>All Positions Come With The Following Benefits<br><br></strong><ul><li>Stock worth CHF 99,000. The stock would be in their parent company (a multi-billion dollar company). You would be able to sell up to a third of your stock per year which would therefore be worth CHF 33,000 per year to you.</li><li>30 days holiday (plus 8 Bank Holidays).</li><li>Flexible working hours</li><li>An early finish on Fridays that fall in the months of June, July and August.</li><li>CHF 10,000 training allowance including attendance of Microsoft events and conferences.</li><li>4 days a month innovative time.</li><li>Free gym membership including yoga sessions.</li><li>Summer BBQs.</li><li>Birthday bonus package – including time off work on your birthday, dinner at a top restaurant or a paid day trip to a European destination<br><br></li></ul>A superb career opportunity so if you’re interested, act and apply today!<br><br><strong>Location</strong>: Bern, Switzerland / Remote Working<br><br><strong>Salary</strong>: CHF 110,000 – CHF 130,000 + Bonus + Pension + Benefits<br><br>NOIRSWITZERLANDREC<br><br>NOIREUROPEREC\n      </div>","salary":null},{"url":"https://uk.linkedin.com/jobs/view/net-developer-net-7-–-social-networking-site-–-london-at-noir-3750156640?refId=RrfznhAM8LrRLKCk8l6Vbg","body":"<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n          relative overflow-hidden\">\n        <ul><li>NET Developer, .NET 7 – Social Networking Site – London<br><br></li></ul>(Tech stack: .NET Developer, .NET 7, C#, Web API 2, Entity Framework, Microservices, Azure, Programmer, Full Stack Engineer, Architect, .NET Developer)<br><br>Our client is the world’s largest social-networking web site and they have ambitions to become the biggest web site in the world! Their global presence currently stretches across 25 countries and their planned expansion for the next 12 months will see another 10 countries added to this list as well as their workforce increasing by 100% in size. Underpinning this success is their hip and cutting-edge .NET / C# technology platform.<br><br>We are seeking several .NET Developer to work on the development of revolutionary new features that will draw users to their web site for longer periods of time. .NET Developer applicants should have a skill set that encompasses: .NET, .NET Core / ASP.NET MVC, C# and SQL Server. We are keen to hear from .NET Developer candidates with a strong understanding object orientated (OO) development and the full software development life cycle.<br><br>This is a rare opportunity to join a truly exciting global brand. Our client offers over 20 days of dedicated technical training per year and exposure to cutting edge technologies such as: .NET 7, Web API 2, Entity Framework, Microservices, Azure, JavaScript, Angular 14, Bootstrap, Agile and SQL Server 2022. Additionally you will follow an official structured career progression program.<br><br><strong>Location:</strong> London, UK / Remote Working<br><br><strong>Salary:</strong> £40,000 – £50,000 + Bonus + Pension + Benefits<br><br>Noir continues to be the leading Microsoft recruitment agency; we can help you make the right career decisions!<br><br>NOIRUKNETREC<br><br>NOIRUKREC\n      </div>","salary":"Salary:</strong> £40,000 – £50,000 + Bonus + Pension + Benefits<br><br>Noir continues to be the leading Microsoft recruitment agency; we can help you make the right career decisions!<br><br>NOIRUKNETREC<br><br>NOIRUKREC\n      </div>"}]