[
  {
    "url": "https://uk.linkedin.com/jobs/view/front-end-developer-at-noir-3744675724?refId=AUCgACLxFpPhrbEsdIY6aw%3D%3D&trackingId=w%2FaBrGNSMrun50%2FIxQxA7g%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "body": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n          relative overflow-hidden\">\n        <strong>Front End Developer – Global Fitness Movement – London<br><br></strong>(Tech stack: Front End Developer, JavaScript, jQuery, HTML5, CSS3, Angular, KnockoutJS, BackboneJS, React, VueJS, Typescript, Web, UI, UX, User Interface, User Experience, Front End Developer)<br><br>Born in 2012 in California, our client began development on an app and website that made finding and booking classes effortless for fitness goers across the state. The company is now changing how people live their lives, bringing together a community of enthusiasts, helping people find the activities that make their true selves come alive or supporting small businesses and studios across the entire globe. They believe that being active is the key to living a happy and healthy life. Our client is now active in over 15 countries and continues rapid growth on a yearly basis.<br><br>It takes a team to make things happen and this team includes some of the most talented Front End Developer (JavaScript, jQuery, Angular) in the industry. They don’t just have the best developers – but also the best karaoke stars, community activists and amateur chefs. Together, they are making the world an active place, which makes every day pretty damn gratifying.<br><br>They are looking for Front End Developer with experience in some or all of the following (full training will be provided to fill any gaps in your skill set): JavaScript, LESS, SASS, ES6, jQuery, HTML5, CSS3, Angular, KnockoutJS, BackboneJS, React, VueJS, Typescript and AJAX.<br><br><strong>All Positions Come With The Following Benefits<br><br></strong><ul><li>Annual bonus.</li><li>Free medical, dental and vision coverage.</li><li>Flexible work hours.</li><li>£5,000 training allowance.</li><li>Healthy (and unhealthy) snacks.</li><li>Charitable giving programs.</li><li>Virtual team classes, events and happy hours.<br><br></li></ul>There is no ‘I’ in team. By working with talented individuals and developing upon innovative ideas, the team continues to succeed and grow. They are a global movement with big plans for the future. It’s an incredible opportunity so if you’re interested, act and apply today!<br><br><strong>Location:</strong> London, UK / Remote Working<br><br><strong>Salary:</strong> £80,000 – £100,000 + Bonus + Pension + Benefits<br><br>NOIRUKTECHREC<br><br>NOIRUKREC<br><br>NC/FELON80100\n      </div>",
    "salary": "Salary:</strong> £80,000 – £100,000 + Bonus + Pension + Benefits<br><br>NOIRUKTECHREC<br><br>NOIRUKREC<br><br>NC/FELON80100\n      </div>"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/react-developer-at-noir-3744680136?refId=AUCgACLxFpPhrbEsdIY6aw%3D%3D&trackingId=GpV1tljKjX6Vc5abc9VYJw%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "body": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n          relative overflow-hidden\">\n        <strong>React Developer – Europe’s Largest Radio Station Group – London<br><br></strong>(Tech stack: React Developer, React, HTML, CSS, JavaScript, Web API, Swagger, Redux, React Router, TypeScript, Cypress, jQuery, Angular, VueJS, Web, UI, UX, User Interface, User Experience, Front End, React Developer)<br><br>Our client is Europe’s largest and most profitable commercial radio group. In order to keep pace with the new digital technologies being developed, they are transforming their stations into interactive brands that can operate across multiple platforms such as online, digital TV and mobile. As such we are seeking React Developer to join their dynamic Front End development team of high flying individuals.<br><br>React Developer applicants should have a skill set that encompasses: React, HTML, CSS, JavaScript, Web API. Our client can provide you with industry recognised training in: React, HTML, CSS, JavaScript, Web API, Swagger, Redux, React Router, TypeScript, Cypress, jQuery, Angular, VueJS.<br><br>This is an exciting opportunity to work on complex enterprise level development projects. Our client offers a structured career progression programme, industry recognized training, flexible working hours and home working. These positions are urgent, as such our client guarantees to provide feedback on CV’s within 24 hours of submission and complete the interview process within 1 week.<br><br><strong>Location: </strong>London, UK / Remote Working<br><br><strong>Salary: </strong>£45,000 – £75,000 + Bonus + Pension + Benefits<br><br>Noir continues to be the leading Tech recruitment agency; we can help you make the right career decisions!<br><br>NOIRUKTECHREC<br><br>NOIRUKREC\n      </div>",
    "salary": "Salary: </strong>£45,000 – £75,000 + Bonus + Pension + Benefits<br><br>Noir continues to be the leading Tech recruitment agency; we can help you make the right career decisions!<br><br>NOIRUKTECHREC<br><br>NOIRUKREC\n      </div>"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/graduate-recruitment-consultant-at-noir-3744676532?refId=AUCgACLxFpPhrbEsdIY6aw%3D%3D&trackingId=IRA7xab737m6xyn6T0PndQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "body": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n          relative overflow-hidden\">\n        <strong>Graduate Recruitment Consultant – Year 1 OTE £44k+ – Monument, London (Sales, B2B, New Business Development, Outbound, Telesales, Junior, Graduate)<br><br></strong><strong>Why join Noir?<br><br></strong>Noir are the industry leading supplier of Microsoft Software Engineers to the UK, Germany and the US. Due to continued high demand we are hiring Graduate Recruitment Consultants. We are looking for ambitious, committed and determined individuals to come and join our fast growing business.<br><br>Apply if you are interested in a career as a Graduate Recruitment Consultant as part of a supportive and motivated team. Our environment allows for maximum earning potential through a generous, simple and fair commission scheme.<br><br>We are hoping to hear from candidates who have either worked in an outbound telesales role or those who believe they would excel in sales if given the opportunity.<br><br><strong>What is the role?<br><br></strong><ul><li>Creating your own network of candidates from a variety of sources including advertising, job boards, LinkedIn and our internal database.</li><li>Developing relationships with new clients, understanding their needs and advising them on suitable candidate profiles and market trends.</li><li>Overseeing the entire recruitment cycle including finding candidates, assessing their skills, matching them to the job and the interview process.</li><li>Acting as a mediator in negotiating with your clients and candidates to secure a sale – the placement of your candidate!</li><li>Achieving challenging sales targets, receiving incentives and bonuses and having fun!<br><br></li></ul>To help you to fulfill our high expectations and your potential, we offer a comprehensive and tailored training programme. We will give you the best tools and opportunity to reach your goals. The rest is up to you! This job offers you the chance to be in control of your own success.<br><br><strong>In return we can offer you<br><br></strong><ul><li>A competitive basic salary.</li><li>Individual, uncapped commission (On Target Earnings – Year 1: £44k+, Year 2: £56k+).</li><li>Holiday incentives – in locations all over the World including Las Vegas, LA, Dubai and Ibiza.</li><li>Lunch clubs – monthly rewards for top performers to Michelin star restaurants.</li><li>£3k annual travel allowance.<br><br></li></ul>We grow our consultants organically and encourage promotion to management level from within the business making this a unique chance for the right person to start as a Graduate Recruitment Consultant and work their way up the firm with a genuine career path.<br><br><strong>Location:</strong> London (Monument / Bank)<br><br>Based in the heart of the City, our offices are within a few minutes’ walk from Monument Underground station.<br><br>For full details please send your CV to Ben Keilty at Noir or call for more details.<br><br><strong>NOIRINTERNALREC</strong>\n      </div>",
    "salary": null
  }
]
